app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2017-09-23 17:26:49.502073"], ["updated_at", "2017-09-23 17:26:49.502073"]]
---
  def create
    Restaurant.create(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "restaurants" SET "description" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["description", "Kentucky Fried Chicken\r\n"], ["updated_at", "2017-09-23 21:34:18.920688"], ["id", 1]]
---
  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)